УчетВУправляющихДляГит1/src/Enums/ВидыОперацийСБилетами/ВидыОперацийСБилетами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийСБилетами</name>
  <enumValues>
    <name>Покупка</name>
  </enumValues>
  <enumValues>
    <name>Доплата</name>
  </enumValues>
  <enumValues>
    <name>Возврат</name>
  </enumValues>
  <enumValues>
    <name>ЗаменаВозврат</name>
  </enumValues>
  <enumValues>
    <name>ЗаменаПокупка</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/Enums/ВидыОперацийСБилетами/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПорядокОперации(ВидОперации) Экспорт

	Если ВидОперации = Покупка Тогда
		Возврат 1;
	ИначеЕсли ВидОперации = ЗаменаПокупка Тогда
		Возврат 2;
	ИначеЕсли ВидОперации = Доплата Тогда
		Возврат 3;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийСБилетами.Возврат Тогда
		Возврат 4;
	ИначеЕсли ВидОперации = ЗаменаВозврат Тогда
		Возврат 5;
	КонецЕсли;	
	
	Возврат 6;

КонецФункции
 		
#КонецЕсли
